yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
#define rFIO0DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x00))
#define rFIO0MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x10))
#define rFIO0PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x14))
#define rFIO0SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x18))
#define rFIO0CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x1C))

#define rFIO1DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x20))
#define rFIO1MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x30))
#define rFIO1PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x34))
#define rFIO1SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x38))
#define rFIO1CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x3C))

#define rFIO2DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x40))
#define rFIO2MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x50))
#define rFIO2PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x54))
#define rFIO2SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x58))
#define rFIO2CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x5C))

#define rFIO3DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x60))
#define rFIO3MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x70))
#define rFIO3PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x74))
#define rFIO3SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x78))
#define rFIO3CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x7C))

#define rFIO4DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x80))
#define rFIO4MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x90))
#define rFIO4PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x94))
#define rFIO4SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x98))
#define rFIO4CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x9C))

//-- FIOs can be accessed through WORD, HALF-WORD or BYTE. --

#define rFIO0DIR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x00))
#define rFIO1DIR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x20))
#define rFIO2DIR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x40))
#define rFIO3DIR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x60))
#define rFIO4DIR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x80))

#define rFIO0DIR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x01))
#define rFIO1DIR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x21))
#define rFIO2DIR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x41))
#define rFIO3DIR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x61))
#define rFIO4DIR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x81))

#define rFIO0DIR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x02))
#define rFIO1DIR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x22))
#define rFIO2DIR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x42))
#define rFIO3DIR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x62))
#define rFIO4DIR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x82))

#define rFIO0DIR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x03))
#define rFIO1DIR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x23))
#define rFIO2DIR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x43))
#define rFIO3DIR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x63))
#define rFIO4DIR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x83))

#define rFIO0DIRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x00))
#define rFIO1DIRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x20))
#define rFIO2DIRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x40))
#define rFIO3DIRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x60))
#define rFIO4DIRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x80))

#define rFIO0DIRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x02))
#define rFIO1DIRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x22))
#define rFIO2DIRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x42))
#define rFIO3DIRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x62))
#define rFIO4DIRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x82))

#define rFIO0MASK0      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x10))
#define rFIO1MASK0      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x30))
#define rFIO2MASK0      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x50))
#define rFIO3MASK0      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x70))
#define rFIO4MASK0      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x90))

#define rFIO0MASK1      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x11))
#define rFIO1MASK1      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x21))
#define rFIO2MASK1      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x51))
#define rFIO3MASK1      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x71))
#define rFIO4MASK1      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x91))

#define rFIO0MASK2      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x12))
#define rFIO1MASK2      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x32))
#define rFIO2MASK2      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x52))
#define rFIO3MASK2      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x72))
#define rFIO4MASK2      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x92))

#define rFIO0MASK3      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x13))
#define rFIO1MASK3      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x33))
#define rFIO2MASK3      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x53))
#define rFIO3MASK3      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x73))
#define rFIO4MASK3      (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x93))

#define rFIO0MASKL      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x10))
#define rFIO1MASKL      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x30))
#define rFIO2MASKL      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x50))
#define rFIO3MASKL      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x70))
#define rFIO4MASKL      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x90))

#define rFIO0MASKU      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x12))
#define rFIO1MASKU      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x32))
#define rFIO2MASKU      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x52))
#define rFIO3MASKU      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x72))
#define rFIO4MASKU      (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x92))

#define rFIO0PIN0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x14))
#define rFIO1PIN0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x34))
#define rFIO2PIN0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x54))
#define rFIO3PIN0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x74))
#define rFIO4PIN0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x94))

