yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
#define rFIO0PIN1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x15))
#define rFIO1PIN1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x25))
#define rFIO2PIN1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x55))
#define rFIO3PIN1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x75))
#define rFIO4PIN1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x95))

#define rFIO0PIN2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x16))
#define rFIO1PIN2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x36))
#define rFIO2PIN2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x56))
#define rFIO3PIN2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x76))
#define rFIO4PIN2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x96))

#define rFIO0PIN3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x17))
#define rFIO1PIN3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x37))
#define rFIO2PIN3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x57))
#define rFIO3PIN3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x77))
#define rFIO4PIN3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x97))

#define rFIO0PINL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x14))
#define rFIO1PINL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x34))
#define rFIO2PINL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x54))
#define rFIO3PINL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x74))
#define rFIO4PINL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x94))

#define rFIO0PINU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x16))
#define rFIO1PINU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x36))
#define rFIO2PINU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x56))
#define rFIO3PINU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x76))
#define rFIO4PINU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x96))

#define rFIO0SET0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x18))
#define rFIO1SET0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x38))
#define rFIO2SET0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x58))
#define rFIO3SET0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x78))
#define rFIO4SET0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x98))

#define rFIO0SET1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x19))
#define rFIO1SET1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x29))
#define rFIO2SET1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x59))
#define rFIO3SET1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x79))
#define rFIO4SET1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x99))

#define rFIO0SET2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1A))
#define rFIO1SET2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3A))
#define rFIO2SET2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5A))
#define rFIO3SET2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7A))
#define rFIO4SET2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9A))

#define rFIO0SET3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1B))
#define rFIO1SET3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3B))
#define rFIO2SET3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5B))
#define rFIO3SET3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7B))
#define rFIO4SET3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9B))

#define rFIO0SETL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x18))
#define rFIO1SETL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x38))
#define rFIO2SETL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x58))
#define rFIO3SETL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x78))
#define rFIO4SETL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x98))

#define rFIO0SETU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x1A))
#define rFIO1SETU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x3A))
#define rFIO2SETU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x5A))
#define rFIO3SETU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x7A))
#define rFIO4SETU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x9A))

#define rFIO0CLR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1C))
#define rFIO1CLR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3C))
#define rFIO2CLR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5C))
#define rFIO3CLR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7C))
#define rFIO4CLR0       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9C))

#define rFIO0CLR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1D))
#define rFIO1CLR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x2D))
#define rFIO2CLR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5D))
#define rFIO3CLR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7D))
#define rFIO4CLR1       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9D))

#define rFIO0CLR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1E))
#define rFIO1CLR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3E))
#define rFIO2CLR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5E))
#define rFIO3CLR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7E))
#define rFIO4CLR2       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9E))

#define rFIO0CLR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1F))
#define rFIO1CLR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3F))
#define rFIO2CLR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5F))
#define rFIO3CLR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7F))
#define rFIO4CLR3       (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9F))

#define rFIO0CLRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x1C))
#define rFIO1CLRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x3C))
#define rFIO2CLRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x5C))
#define rFIO3CLRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x7C))
#define rFIO4CLRL       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x9C))

#define rFIO0CLRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x1E))
#define rFIO1CLRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x3E))
#define rFIO2CLRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x5E))
#define rFIO3CLRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x7E))
#define rFIO4CLRU       (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x9E))


//-- System Control Block(SCB) modules include Memory Accelerator Module,
//-- Phase Locked Loop, VPB divider, Power Control, External Interrupt,
//-- Reset, and Code Security/Debugging

