yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
#define SCB_BASE_ADDR        0xE01FC000

//-- Memory Accelerator Module (MAM) --

#define rMAMCR          (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x000))
#define rMAMTIM         (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x004))
#define rMEMMAP         (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x040))

//-- Phase Locked Loop (PLL) --

#define rPLLCON         (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x080))
#define rPLLCFG         (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x084))
#define rPLLSTAT        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x088))
#define rPLLFEED        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x08C))

//-- Power Control --

#define rPCON           (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0C0))
#define rPCONP          (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0C4))

//-- Clock Divider --

#define rCCLKCFG        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x104))
#define rUSBCLKCFG      (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x108))
#define rCLKSRCSEL      (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x10C))
#define rPCLKSEL0       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A8))
#define rPCLKSEL1       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1AC))

//-- External Interrupts --

#define rEXTINT         (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x140))
#define rINTWAKE        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x144))
#define rEXTMODE        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x148))
#define rEXTPOLAR       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x14C))

//-- Reset, reset source identification --

#define rRSIR           (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x180))

//-- RSID, code security protection --

#define rCSPR           (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x184))

//-- AHB configuration --

#define rAHBCFG1        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x188))
#define rAHBCFG2        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x18C))

//-- System Controls and Status --

#define rSCS            (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A0))

//-- MPMC(EMC) registers, note: all the external memory controller(EMC)
//-- registers are for LPC24xx only.

#define rSTATIC_MEM0_BASE                0x80000000
#define rSTATIC_MEM1_BASE                0x81000000
#define rSTATIC_MEM2_BASE                0x82000000
#define rSTATIC_MEM3_BASE                0x83000000

#define rDYNAMIC_MEM0_BASE                0xA0000000
#define rDYNAMIC_MEM1_BASE                0xB0000000
#define rDYNAMIC_MEM2_BASE                0xC0000000
#define rDYNAMIC_MEM3_BASE                0xD0000000

//-- External Memory Controller (EMC) --

#define EMC_BASE_ADDR                0xFFE08000

#define rEMC_CTRL       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x000))
#define rEMC_STAT       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x004))
#define rEMC_CONFIG     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x008))

//-- Dynamic RAM access registers --

#define rEMC_DYN_CTRL     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x020))
#define rEMC_DYN_RFSH     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x024))
#define rEMC_DYN_RD_CFG   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x028))
#define rEMC_DYN_RP       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x030))
#define rEMC_DYN_RAS      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x034))
#define rEMC_DYN_SREX     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x038))
#define rEMC_DYN_APR      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x03C))
#define rEMC_DYN_DAL      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x040))
#define rEMC_DYN_WR       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x044))
#define rEMC_DYN_RC       (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x048))
#define rEMC_DYN_RFC      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x04C))
#define rEMC_DYN_XSR      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x050))
#define rEMC_DYN_RRD      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x054))
#define rEMC_DYN_MRD      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x058))

#define rEMC_DYN_CFG0     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x100))
#define rEMC_DYN_RASCAS0  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x104))
#define rEMC_DYN_CFG1     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x140))
#define rEMC_DYN_RASCAS1  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x144))
#define rEMC_DYN_CFG2     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x160))
#define rEMC_DYN_RASCAS2  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x164))
#define rEMC_DYN_CFG3     (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x180))
#define rEMC_DYN_RASCAS3  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x184))

//-- static RAM access registers --

#define rEMC_STA_CFG0      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x200))
#define rEMC_STA_WAITWEN0  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x204))
#define rEMC_STA_WAITOEN0  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x208))
#define rEMC_STA_WAITRD0   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x20C))
#define rEMC_STA_WAITPAGE0 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x210))
#define rEMC_STA_WAITWR0   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x214))
#define rEMC_STA_WAITTURN0 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x218))

#define rEMC_STA_CFG1      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x220))
#define rEMC_STA_WAITWEN1  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x224))
#define rEMC_STA_WAITOEN1  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x228))
#define rEMC_STA_WAITRD1   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x22C))
#define rEMC_STA_WAITPAGE1 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x230))
#define rEMC_STA_WAITWR1   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x234))
#define rEMC_STA_WAITTURN1 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x238))

#define rEMC_STA_CFG2      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x240))
#define rEMC_STA_WAITWEN2  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x244))
#define rEMC_STA_WAITOEN2  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x248))
#define rEMC_STA_WAITRD2   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x24C))
#define rEMC_STA_WAITPAGE2 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x250))
#define rEMC_STA_WAITWR2   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x254))
#define rEMC_STA_WAITTURN2 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x258))

#define rEMC_STA_CFG3      (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x260))
#define rEMC_STA_WAITWEN3  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x264))
#define rEMC_STA_WAITOEN3  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x268))
#define rEMC_STA_WAITRD3   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x26C))
#define rEMC_STA_WAITPAGE3 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x270))
#define rEMC_STA_WAITWR3   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x274))
#define rEMC_STA_WAITTURN3 (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x278))

#define rEMC_STA_EXT_WAIT  (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x880))

