yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
//-- Timer 0 --

#define TMR0_BASE_ADDR                0xE0004000

#define rT0IR           (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x00))
#define rT0TCR          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x04))
#define rT0TC           (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x08))
#define rT0PR           (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x0C))
#define rT0PC           (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x10))
#define rT0MCR          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x14))
#define rT0MR0          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x18))
#define rT0MR1          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x1C))
#define rT0MR2          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x20))
#define rT0MR3          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x24))
#define rT0CCR          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x28))
#define rT0CR0          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x2C))
#define rT0CR1          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x30))
#define rT0CR2          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x34))
#define rT0CR3          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x38))
#define rT0EMR          (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x3C))
#define rT0CTCR         (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x70))

//-- Timer 1 --

#define TMR1_BASE_ADDR                0xE0008000

#define rT1IR           (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x00))
#define rT1TCR          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x04))
#define rT1TC           (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x08))
#define rT1PR           (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x0C))
#define rT1PC           (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x10))
#define rT1MCR          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x14))
#define rT1MR0          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x18))
#define rT1MR1          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x1C))
#define rT1MR2          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x20))
#define rT1MR3          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x24))
#define rT1CCR          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x28))
#define rT1CR0          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x2C))
#define rT1CR1          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x30))
#define rT1CR2          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x34))
#define rT1CR3          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x38))
#define rT1EMR          (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x3C))
#define rT1CTCR         (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x70))

//-- Timer 2 --

#define TMR2_BASE_ADDR                0xE0070000

#define rT2IR           (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x00))
#define rT2TCR          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x04))
#define rT2TC           (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x08))
#define rT2PR           (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x0C))
#define rT2PC           (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x10))
#define rT2MCR          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x14))
#define rT2MR0          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x18))
#define rT2MR1          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x1C))
#define rT2MR2          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x20))
#define rT2MR3          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x24))
#define rT2CCR          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x28))
#define rT2CR0          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x2C))
#define rT2CR1          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x30))
#define rT2CR2          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x34))
#define rT2CR3          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x38))
#define rT2EMR          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x3C))
#define rT2CTCR         (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x70))

//-- Timer 3 --

#define TMR3_BASE_ADDR                0xE0074000

#define rT3IR           (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x00))
#define rT3TCR          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x04))
#define rT3TC           (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x08))
#define rT3PR           (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x0C))
#define rT3PC           (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x10))
#define rT3MCR          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x14))
#define rT3MR0          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x18))
#define rT3MR1          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x1C))
#define rT3MR2          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x20))
#define rT3MR3          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x24))
#define rT3CCR          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x28))
#define rT3CR0          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x2C))
#define rT3CR1          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x30))
#define rT3CR2          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x34))
#define rT3CR3          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x38))
#define rT3EMR          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x3C))
#define rT3CTCR         (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x70))


//-- Pulse Width Modulator (PWM) --

#define PWM0_BASE_ADDR                0xE0014000

#define rPWM0IR          (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x00))
#define rPWM0TCR         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x04))
#define rPWM0TC          (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x08))
#define rPWM0PR          (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x0C))
#define rPWM0PC          (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x10))
#define rPWM0MCR         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x14))
#define rPWM0MR0         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x18))
#define rPWM0MR1         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x1C))
#define rPWM0MR2         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x20))
#define rPWM0MR3         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x24))
#define rPWM0CCR         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x28))
#define rPWM0CR0         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x2C))
#define rPWM0CR1         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x30))
#define rPWM0CR2         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x34))
#define rPWM0CR3         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x38))
#define rPWM0EMR         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x3C))
#define rPWM0MR4         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x40))
#define rPWM0MR5         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x44))
#define rPWM0MR6         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x48))
#define rPWM0PCR         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x4C))
#define rPWM0LER         (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x50))
#define rPWM0CTCR        (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x70))

#define PWM1_BASE_ADDR                0xE0018000

#define rPWM1IR          (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x00))
#define rPWM1TCR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x04))
#define rPWM1TC          (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x08))
#define rPWM1PR          (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x0C))
#define rPWM1PC          (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x10))
#define rPWM1MCR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x14))
#define rPWM1MR0         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x18))
#define rPWM1MR1         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x1C))
#define rPWM1MR2         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x20))
#define rPWM1MR3         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x24))
#define rPWM1CCR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x28))
#define rPWM1CR0         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x2C))
#define rPWM1CR1         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x30))
#define rPWM1CR2         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x34))
#define rPWM1CR3         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x38))
#define rPWM1EMR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x3C))
#define rPWM1MR4         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x40))
#define rPWM1MR5         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x44))
#define rPWM1MR6         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x48))
#define rPWM1PCR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x4C))
#define rPWM1LER         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x50))
#define rPWM1CTCR        (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x70))

