yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
//-- Universal Asynchronous Receiver Transmitter 0 (UART0) --

#define UART0_BASE_ADDR                0xE000C000

#define rU0RBR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define rU0THR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define rU0DLL          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define rU0DLM          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x04))
#define rU0IER          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x04))
#define rU0IIR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x08))
#define rU0FCR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x08))
#define rU0LCR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x0C))
#define rU0LSR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x14))
#define rU0SCR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x1C))
#define rU0ACR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x20))
#define rU0ICR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x24))
#define rU0FDR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x28))
#define rU0TER          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x30))

//-- Universal Asynchronous Receiver Transmitter 1 (UART1) --

#define UART1_BASE_ADDR                0xE0010000

#define rU1RBR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define rU1THR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define rU1DLL          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define rU1DLM          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x04))
#define rU1IER          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x04))
#define rU1IIR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x08))
#define rU1FCR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x08))
#define rU1LCR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x0C))
#define rU1MCR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x10))
#define rU1LSR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x14))
#define rU1MSR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x18))
#define rU1SCR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x1C))
#define rU1ACR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x20))
#define rU1FDR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x28))
#define rU1TER          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x30))

//-- Universal Asynchronous Receiver Transmitter 2 (UART2) --

#define UART2_BASE_ADDR                0xE0078000

#define rU2RBR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x00))
#define rU2THR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x00))
#define rU2DLL          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x00))
#define rU2DLM          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x04))
#define rU2IER          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x04))
#define rU2IIR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x08))
#define rU2FCR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x08))
#define rU2LCR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x0C))
#define rU2LSR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x14))
#define rU2SCR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x1C))
#define rU2ACR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x20))
#define rU2ICR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x24))
#define rU2FDR          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x28))
#define rU2TER          (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x30))

//-- Universal Asynchronous Receiver Transmitter 3 (UART3) --

#define UART3_BASE_ADDR                0xE007C000

#define rU3RBR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define rU3THR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define rU3DLL          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define rU3DLM          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x04))
#define rU3IER          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x04))
#define rU3IIR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x08))
#define rU3FCR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x08))
#define rU3LCR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x0C))
#define rU3LSR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x14))
#define rU3SCR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x1C))
#define rU3ACR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x20))
#define rU3ICR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x24))
#define rU3FDR          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x28))
#define rU3TER          (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x30))

//-- I2C Interface 0 --

#define I2C0_BASE_ADDR                0xE001C000

#define rI20CONSET      (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x00))
#define rI20STAT        (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x04))
#define rI20DAT         (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x08))
#define rI20ADR         (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x0C))
#define rI20SCLH        (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x10))
#define rI20SCLL        (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x14))
#define rI20CONCLR      (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x18))

//-- I2C Interface 1 --

#define I2C1_BASE_ADDR                0xE005C000

#define rI21CONSET      (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x00))
#define rI21STAT        (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x04))
#define rI21DAT         (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x08))
#define rI21ADR         (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x0C))
#define rI21SCLH        (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x10))
#define rI21SCLL        (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x14))
#define rI21CONCLR      (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x18))

