yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
//-- I2C Interface 2 --

#define I2C2_BASE_ADDR                0xE0080000

#define rI22CONSET      (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x00))
#define rI22STAT        (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x04))
#define rI22DAT         (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x08))
#define rI22ADR         (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x0C))
#define rI22SCLH        (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x10))
#define rI22SCLL        (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x14))
#define rI22CONCLR      (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x18))

//-- SPI0 (Serial Peripheral Interface 0) --

#define SPI0_BASE_ADDR                0xE0020000

#define rS0SPCR         (*(volatile unsigned long *)(SPI0_BASE_ADDR + 0x00))
#define rS0SPSR         (*(volatile unsigned long *)(SPI0_BASE_ADDR + 0x04))
#define rS0SPDR         (*(volatile unsigned long *)(SPI0_BASE_ADDR + 0x08))
#define rS0SPCCR        (*(volatile unsigned long *)(SPI0_BASE_ADDR + 0x0C))
#define rS0SPINT        (*(volatile unsigned long *)(SPI0_BASE_ADDR + 0x1C))

//-- SSP0 Controller --

#define SSP0_BASE_ADDR                0xE0068000

#define rSSP0CR0        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x00))
#define rSSP0CR1        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x04))
#define rSSP0DR         (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x08))
#define rSSP0SR         (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x0C))
#define rSSP0CPSR       (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x10))
#define rSSP0IMSC       (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x14))
#define rSSP0RIS        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x18))
#define rSSP0MIS        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x1C))
#define rSSP0ICR        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x20))
#define rSSP0DMACR      (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x24))

//-- SSP1 Controller --

#define SSP1_BASE_ADDR                0xE0030000

#define rSSP1CR0        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x00))
#define rSSP1CR1        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x04))
#define rSSP1DR         (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x08))
#define rSSP1SR         (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x0C))
#define rSSP1CPSR       (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x10))
#define rSSP1IMSC       (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x14))
#define rSSP1RIS        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x18))
#define rSSP1MIS        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x1C))
#define rSSP1ICR        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x20))
#define rSSP1DMACR      (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x24))

//-- Real Time Clock --

#define RTC_BASE_ADDR                0xE0024000

#define rRTC_ILR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x00))
#define rRTC_CTC         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x04))
#define rRTC_CCR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x08))
#define rRTC_CIIR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x0C))
#define rRTC_AMR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x10))
#define rRTC_CTIME0      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x14))
#define rRTC_CTIME1      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x18))
#define rRTC_CTIME2      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x1C))
#define rRTC_SEC         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x20))
#define rRTC_MIN         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x24))
#define rRTC_HOUR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x28))
#define rRTC_DOM         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x2C))
#define rRTC_DOW         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x30))
#define rRTC_DOY         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x34))
#define rRTC_MONTH       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x38))
#define rRTC_YEAR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x3C))
#define rRTC_CISS        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x40))
#define rRTC_ALSEC       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x60))
#define rRTC_ALMIN       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x64))
#define rRTC_ALHOUR      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x68))
#define rRTC_ALDOM       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x6C))
#define rRTC_ALDOW       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x70))
#define rRTC_ALDOY       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x74))
#define rRTC_ALMON       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x78))
#define rRTC_ALYEAR      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x7C))
#define rRTC_PREINT      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x80))
#define rRTC_PREFRAC     (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x84))

//-- A/D Converter 0 (AD0) --

#define AD0_BASE_ADDR                0xE0034000

#define rAD0CR          (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x00))
#define rAD0GDR         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x04))
#define rAD0INTEN       (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x0C))
#define rAD0DR0         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x10))
#define rAD0DR1         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x14))
#define rAD0DR2         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x18))
#define rAD0DR3         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x1C))
#define rAD0DR4         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x20))
#define rAD0DR5         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x24))
#define rAD0DR6         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x28))
#define rAD0DR7         (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x2C))
#define rAD0STAT        (*(volatile unsigned long *)(AD0_BASE_ADDR + 0x30))

//-- D/A Converter --

#define DAC_BASE_ADDR                0xE006C000
#define rDACR           (*(volatile unsigned long *)(DAC_BASE_ADDR + 0x00))

//-- Watchdog --

#define WDG_BASE_ADDR                0xE0000000

#define rWDMOD          (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x00))
#define rWDTC           (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x04))
#define rWDFEED         (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x08))
#define rWDTV           (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x0C))
#define rWDCLKSEL       (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x10))

//-- CAN CONTROLLERS AND ACCEPTANCE FILTER --

#define CAN_ACCEPT_BASE_ADDR                0xE003C000

#define rCAN_AFMR        (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x00))
#define rCAN_SFF_SA      (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x04))
#define rCAN_SFF_GRP_SA  (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x08))
#define rCAN_EFF_SA      (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x0C))
#define rCAN_EFF_GRP_SA  (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x10))
#define rCAN_EOT         (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x14))
#define rCAN_LUT_ERR_ADR (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x18))
#define rCAN_LUT_ERR     (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x1C))

