yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
#define CAN_CENTRAL_BASE_ADDR                0xE0040000

#define rCAN_TX_SR       (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x00))
#define rCAN_RX_SR       (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x04))
#define rCAN_MSR         (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x08))

#define CAN1_BASE_ADDR                0xE0044000

#define rCAN1MOD         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x00))
#define rCAN1CMR         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x04))
#define rCAN1GSR         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x08))
#define rCAN1ICR         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x0C))
#define rCAN1IER         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x10))
#define rCAN1BTR         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x14))
#define rCAN1EWL         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x18))
#define rCAN1SR          (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x1C))
#define rCAN1RFS         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x20))
#define rCAN1RID         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x24))
#define rCAN1RDA         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x28))
#define rCAN1RDB         (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x2C))

#define rCAN1TFI1        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x30))
#define rCAN1TID1        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x34))
#define rCAN1TDA1        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x38))
#define rCAN1TDB1        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x3C))
#define rCAN1TFI2        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x40))
#define rCAN1TID2        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x44))
#define rCAN1TDA2        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x48))
#define rCAN1TDB2        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x4C))
#define rCAN1TFI3        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x50))
#define rCAN1TID3        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x54))
#define rCAN1TDA3        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x58))
#define rCAN1TDB3        (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x5C))

#define CAN2_BASE_ADDR                0xE0048000

#define rCAN2MOD         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x00))
#define rCAN2CMR         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x04))
#define rCAN2GSR         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x08))
#define rCAN2ICR         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x0C))
#define rCAN2IER         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x10))
#define rCAN2BTR         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x14))
#define rCAN2EWL         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x18))
#define rCAN2SR          (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x1C))
#define rCAN2RFS         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x20))
#define rCAN2RID         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x24))
#define rCAN2RDA         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x28))
#define rCAN2RDB         (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x2C))

#define rCAN2TFI1        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x30))
#define rCAN2TID1        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x34))
#define rCAN2TDA1        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x38))
#define rCAN2TDB1        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x3C))
#define rCAN2TFI2        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x40))
#define rCAN2TID2        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x44))
#define rCAN2TDA2        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x48))
#define rCAN2TDB2        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x4C))
#define rCAN2TFI3        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x50))
#define rCAN2TID3        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x54))
#define rCAN2TDA3        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x58))
#define rCAN2TDB3        (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x5C))

//-- MultiMedia Card Interface(MCI) Controller ---

#define MCI_BASE_ADDR                0xE008C000

#define rMCI_POWER       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x00))
#define rMCI_CLOCK       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x04))
#define rMCI_ARGUMENT    (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x08))
#define rMCI_COMMAND     (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x0C))
#define rMCI_RESP_CMD    (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x10))
#define rMCI_RESP0       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x14))
#define rMCI_RESP1       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x18))
#define rMCI_RESP2       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x1C))
#define rMCI_RESP3       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x20))
#define rMCI_DATA_TMR    (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x24))
#define rMCI_DATA_LEN    (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x28))
#define rMCI_DATA_CTRL   (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x2C))
#define rMCI_DATA_CNT    (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x30))
#define rMCI_STATUS      (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x34))
#define rMCI_CLEAR       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x38))
#define rMCI_MASK0       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x3C))
#define rMCI_MASK1       (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x40))
#define rMCI_FIFO_CNT    (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x48))
#define rMCI_FIFO        (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x80))

//-- I2S Interface Controller (I2S)

#define I2S_BASE_ADDR                0xE0088000

#define rI2S_DAO        (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x00))
#define rI2S_DAI        (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x04))
#define rI2S_TX_FIFO    (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x08))
#define rI2S_RX_FIFO    (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x0C))
#define rI2S_STATE      (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x10))
#define rI2S_DMA1       (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x14))
#define rI2S_DMA2       (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x18))
#define rI2S_IRQ        (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x1C))
#define rI2S_TXRATE     (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x20))
#define rI2S_RXRATE     (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x24))

//-- General-purpose DMA Controller --

