yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
#define DMA_BASE_ADDR                0xFFE04000

#define rGPDMA_INT_STAT         (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x000))
#define rGPDMA_INT_TCSTAT       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x004))
#define rGPDMA_INT_TCCLR        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x008))
#define rGPDMA_INT_ERR_STAT     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x00C))
#define rGPDMA_INT_ERR_CLR      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x010))
#define rGPDMA_RAW_INT_TCSTAT   (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x014))
#define rGPDMA_RAW_INT_ERR_STAT (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x018))
#define rGPDMA_ENABLED_CHNS     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x01C))
#define rGPDMA_SOFT_BREQ        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x020))
#define rGPDMA_SOFT_SREQ        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x024))
#define rGPDMA_SOFT_LBREQ       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x028))
#define rGPDMA_SOFT_LSREQ       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x02C))
#define rGPDMA_CONFIG           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x030))
#define rGPDMA_SYNC             (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x034))

//-- DMA channel 0 registers --

#define rGPDMA_CH0_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x100))
#define rGPDMA_CH0_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x104))
#define rGPDMA_CH0_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x108))
#define rGPDMA_CH0_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x10C))
#define rGPDMA_CH0_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x110))

//-- DMA channel 1 registers --

#define rGPDMA_CH1_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x120))
#define rGPDMA_CH1_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x124))
#define rGPDMA_CH1_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x128))
#define rGPDMA_CH1_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x12C))
#define rGPDMA_CH1_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x130))


//-- USB Controller --

#define USB_INT_BASE_ADDR  0xE01FC1C0

#define USB_BASE_ADDR      0xFFE0C200                //-- USB Base Address

#define rUSB_INT_STAT    (*(volatile unsigned long *)(USB_INT_BASE_ADDR + 0x00))

//-- USB Device Interrupt Registers --

#define rDEV_INT_STAT    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x00))
#define rDEV_INT_EN      (*(volatile unsigned long *)(USB_BASE_ADDR + 0x04))
#define rDEV_INT_CLR     (*(volatile unsigned long *)(USB_BASE_ADDR + 0x08))
#define rDEV_INT_SET     (*(volatile unsigned long *)(USB_BASE_ADDR + 0x0C))
#define rDEV_INT_PRIO    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x2C))

//-- USB Device Endpoint Interrupt Registers --

#define rEP_INT_STAT     (*(volatile unsigned long *)(USB_BASE_ADDR + 0x30))
#define rEP_INT_EN       (*(volatile unsigned long *)(USB_BASE_ADDR + 0x34))
#define rEP_INT_CLR      (*(volatile unsigned long *)(USB_BASE_ADDR + 0x38))
#define rEP_INT_SET      (*(volatile unsigned long *)(USB_BASE_ADDR + 0x3C))
#define rEP_INT_PRIO     (*(volatile unsigned long *)(USB_BASE_ADDR + 0x40))

//-- USB Device Endpoint Realization Registers --

#define rREALIZE_EP      (*(volatile unsigned long *)(USB_BASE_ADDR + 0x44))
#define rEP_INDEX        (*(volatile unsigned long *)(USB_BASE_ADDR + 0x48))
#define rMAXPACKET_SIZE  (*(volatile unsigned long *)(USB_BASE_ADDR + 0x4C))

//-- USB Device Command Reagisters --

#define rCMD_CODE        (*(volatile unsigned long *)(USB_BASE_ADDR + 0x10))
#define rCMD_DATA        (*(volatile unsigned long *)(USB_BASE_ADDR + 0x14))

//-- USB Device Data Transfer Registers --

#define rRX_DATA         (*(volatile unsigned long *)(USB_BASE_ADDR + 0x18))
#define rTX_DATA         (*(volatile unsigned long *)(USB_BASE_ADDR + 0x1C))
#define rRX_PLENGTH      (*(volatile unsigned long *)(USB_BASE_ADDR + 0x20))
#define rTX_PLENGTH      (*(volatile unsigned long *)(USB_BASE_ADDR + 0x24))
#define rUSB_CTRL        (*(volatile unsigned long *)(USB_BASE_ADDR + 0x28))

//-- USB Device DMA Registers --

#define rDMA_REQ_STAT      (*(volatile unsigned long *)(USB_BASE_ADDR + 0x50))
#define rDMA_REQ_CLR       (*(volatile unsigned long *)(USB_BASE_ADDR + 0x54))
#define rDMA_REQ_SET       (*(volatile unsigned long *)(USB_BASE_ADDR + 0x58))
#define rUDCA_HEAD         (*(volatile unsigned long *)(USB_BASE_ADDR + 0x80))
#define rEP_DMA_STAT       (*(volatile unsigned long *)(USB_BASE_ADDR + 0x84))
#define rEP_DMA_EN         (*(volatile unsigned long *)(USB_BASE_ADDR + 0x88))
#define rEP_DMA_DIS        (*(volatile unsigned long *)(USB_BASE_ADDR + 0x8C))
#define rDMA_INT_STAT      (*(volatile unsigned long *)(USB_BASE_ADDR + 0x90))
#define rDMA_INT_EN        (*(volatile unsigned long *)(USB_BASE_ADDR + 0x94))
#define rEOT_INT_STAT      (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA0))
#define rEOT_INT_CLR       (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA4))
#define rEOT_INT_SET       (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA8))
#define rNDD_REQ_INT_STAT  (*(volatile unsigned long *)(USB_BASE_ADDR + 0xAC))
#define rNDD_REQ_INT_CLR   (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB0))
#define rNDD_REQ_INT_SET   (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB4))
#define rSYS_ERR_INT_STAT  (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB8))
#define rSYS_ERR_INT_CLR   (*(volatile unsigned long *)(USB_BASE_ADDR + 0xBC))
#define rSYS_ERR_INT_SET   (*(volatile unsigned long *)(USB_BASE_ADDR + 0xC0))

//-- USB Host and OTG registers are for LPC24xx only --
//-- USB Host Controller --

#define USBHC_BASE_ADDR                0xFFE0C000

#define rHC_REVISION        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x00))
#define rHC_CONTROL         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x04))
#define rHC_CMD_STAT        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x08))
#define rHC_INT_STAT        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x0C))
#define rHC_INT_EN          (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x10))
#define rHC_INT_DIS         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x14))
#define rHC_HCCA            (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x18))
#define rHC_PERIOD_CUR_ED   (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x1C))
#define rHC_CTRL_HEAD_ED    (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x20))
#define rHC_CTRL_CUR_ED     (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x24))
#define rHC_BULK_HEAD_ED    (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x28))
#define rHC_BULK_CUR_ED     (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x2C))
#define rHC_DONE_HEAD       (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x30))
#define rHC_FM_INTERVAL     (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x34))
#define rHC_FM_REMAINING    (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x38))
#define rHC_FM_NUMBER       (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x3C))
#define rHC_PERIOD_START    (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x40))
#define rHC_LS_THRHLD       (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x44))
#define rHC_RH_DESCA        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x48))
#define rHC_RH_DESCB        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x4C))
#define rHC_RH_STAT         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x50))
#define rHC_RH_PORT_STAT1   (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x54))
#define rHC_RH_PORT_STAT2   (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x58))

//-- USB OTG Controller --

#define USBOTG_BASE_ADDR        0xFFE0C100

#define rOTG_INT_STAT       (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x00))
#define rOTG_INT_EN         (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x04))
#define rOTG_INT_SET        (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x08))
#define rOTG_INT_CLR        (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x0C))

