yuri-tnk/TNKernel_v3/common_arm/inc/LPC236x.h
//-- On LPC23xx, the name is USBPortSel, on LPC24xx, the name is OTG_STAT_CTRL

#define rOTG_STAT_CTRL      (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x10))
#define rOTG_TIMER          (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x14))

#define USBOTG_I2C_BASE_ADDR        0xFFE0C300

#define rOTG_I2C_RX         (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x00))
#define rOTG_I2C_TX         (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x00))
#define rOTG_I2C_STS        (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x04))
#define rOTG_I2C_CTL        (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x08))
#define rOTG_I2C_CLKHI      (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x0C))
#define rOTG_I2C_CLKLO      (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x10))

//-- On LPC23xx, the names are USBClkCtrl and USBClkSt; on LPC24xx, the names
//-- are OTG_CLK_CTRL and OTG_CLK_STAT respectively.

#define USBOTG_CLK_BASE_ADDR        0xFFE0CFF0

#define rOTG_CLK_CTRL        (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x04))
#define rOTG_CLK_STAT        (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x08))

//-- Note: below three register name convention is for LPC23xx USB device only,
//-- match with the spec. update in USB Device Section.

#define rUSBPortSel          (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x10))
#define rUSBClkCtrl          (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x04))
#define rUSBClkSt            (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x08))

//-- Ethernet MAC (32 bit data bus) -- all registers are RW unless indicated in parentheses

#define MAC_BASE_ADDR                0xFFE00000 //-- AHB Peripheral # 0

#define rMAC_MAC1            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x000)) // MAC config reg 1
#define rMAC_MAC2            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x004)) // MAC config reg 2
#define rMAC_IPGT            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x008)) // b2b InterPacketGap reg
#define rMAC_IPGR            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x00C)) // non b2b InterPacketGap reg
#define rMAC_CLRT            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x010)) // CoLlision window/ReTry reg
#define rMAC_MAXF            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x014)) // MAXimum Frame reg
#define rMAC_SUPP            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x018)) // PHY SUPPort reg
#define rMAC_TEST            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x01C)) // TEST reg
#define rMAC_MCFG            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x020)) // MII Mgmt ConFiG reg
#define rMAC_MCMD            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x024)) // MII Mgmt CoMmanD reg
#define rMAC_MADR            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x028)) // MII Mgmt ADdRess reg
#define rMAC_MWTD            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x02C)) // MII Mgmt WriTe Data reg (WO)
#define rMAC_MRDD            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x030)) // MII Mgmt ReaD Data reg (RO)
#define rMAC_MIND            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x034)) // MII Mgmt INDicators reg (RO)

#define rMAC_SA0             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x040)) // Station Address 0 reg
#define rMAC_SA1             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x044)) // Station Address 1 reg
#define rMAC_SA2             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x048)) // Station Address 2 reg

#define rMAC_COMMAND         (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x100)) // Command reg
#define rMAC_STATUS          (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x104)) // Status reg (RO)
#define rMAC_RXDESCRIPTOR    (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x108)) // Rx descriptor base address reg
#define rMAC_RXSTATUS        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x10C)) // Rx status base address reg
#define rMAC_RXDESCRIPTORNUM (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x110)) // Rx number of descriptors reg
#define rMAC_RXPRODUCEINDEX  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x114)) // Rx produce index reg (RO)
#define rMAC_RXCONSUMEINDEX  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x118)) // Rx consume index reg
#define rMAC_TXDESCRIPTOR    (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x11C)) // Tx descriptor base address reg
#define rMAC_TXSTATUS        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x120)) // Tx status base address reg
#define rMAC_TXDESCRIPTORNUM (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x124)) // Tx number of descriptors reg
#define rMAC_TXPRODUCEINDEX  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x128)) // Tx produce index reg
#define rMAC_TXCONSUMEINDEX  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x12C)) // Tx consume index reg (RO)

#define rMAC_TSV0            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x158)) // Tx status vector 0 reg (RO)
#define rMAC_TSV1            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x15C)) // Tx status vector 1 reg (RO)
#define rMAC_RSV             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x160)) // Rx status vector reg (RO)

#define rMAC_FLOWCONTROLCNT  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x170)) // Flow control counter reg
#define rMAC_FLOWCONTROLSTS  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x174)) // Flow control status reg

#define rMAC_RXFILTERCTRL    (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x200)) // Rx filter ctrl reg
#define rMAC_RXFILTERWOLSTS  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x204)) // Rx filter WoL status reg (RO)
#define rMAC_RXFILTERWOLCLR  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x208)) // Rx filter WoL clear reg (WO)

#define rMAC_HASHFILTERL     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x210)) // Hash filter LSBs reg
#define rMAC_HASHFILTERH     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x214)) // Hash filter MSBs reg

#define rMAC_INTSTATUS       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE0)) // Interrupt status reg (RO)
#define rMAC_INTENABLE       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE4)) // Interrupt enable reg
#define rMAC_INTCLEAR        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE8)) // Interrupt clear reg (WO)
#define rMAC_INTSET          (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFEC)) // Interrupt set reg (WO)

#define rMAC_POWERDOWN       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFF4)) // Power-down reg
#define rMAC_MODULEID        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFFC)) // Module ID reg (RO)

#endif




